# Module 1 - Manipulating data with Pandas
## Pandas Part 2

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)

## Scenario:
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. In this lecture, we are continue to look at a real data set collected by Austin Animal Center over several years and use our pandas skills from the last lecture and learn some new ones in order to explore this data further.

#### _Our goals today are to be able to_: <br/>

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use info, describe and dtypes
  - Use mean, min, max, and value_counts 
- Use apply and applymap to transform columns and create new values

- Explain lambda functions and use them to use an apply on a DataFrame
- Explain what a groupby object is and split a DataFrame using a groupby
- Reshape a DataFrame using joins, merges, pivoting, stacking, and melting

## Getting started

Let's take a moment to examine the [Austin Animal Center data set](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238/data). What kinds of questions can we ask this data and what kinds of information can we get back?

In pairs and as a class, let's generate ideas.

## Switch gears

Before we answer those questions about the animal shelter data, let's practice on a simpler dataset.
Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci
![heart-data](images/heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset and its variables

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [1]:
!pwd
!ls -al

/Users/rhirsch/Documents/git_test/houston-ds-071519-manipulating-data-with-pandas
total 104
drwxr-xr-x  12 rhirsch  staff    384 Jul 18 10:41 .
drwxr-xr-x   7 rhirsch  staff    224 Jul 18 10:30 ..
drwxr-xr-x  13 rhirsch  staff    416 Jul 18 10:31 .git
-rw-r--r--   1 rhirsch  staff   1203 Jul 18 10:30 .gitignore
drwxr-xr-x   3 rhirsch  staff     96 Jul 18 10:41 .ipynb_checkpoints
-rw-r--r--   1 rhirsch  staff     95 Jul 18 10:30 ds_chars.csv
-rw-r--r--   1 rhirsch  staff  11328 Jul 18 10:30 heart.csv
drwxr-xr-x   4 rhirsch  staff    128 Jul 18 10:31 images
-rw-r--r--   1 rhirsch  staff  17390 Jul 18 10:41 manipulating_data_with_pandas.ipynb
-rw-r--r--   1 rhirsch  staff   1735 Jul 18 10:30 pandas-202-solution.md
-rw-r--r--   1 rhirsch  staff   3297 Jul 18 10:30 pre_process_animal_shelter_data.py
-rw-r--r--   1 rhirsch  staff    130 Jul 18 10:30 states.csv

In [2]:
import pandas as pd
uci = pd.read_csv('heart.csv')

In [3]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### The `.columns` and `.shape` Attributes

In [4]:
uci.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [5]:
uci.shape

(303, 14)

#### The `.info() `and `.describe()` and `.dtypes` methods

Pandas DataFrames have many useful methods! Let's look at `.info()` , `.describe()`, and `dtypes`.

In [6]:
# Call the .info() method on our dataset. What do you observe?

uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.2 KB

In [7]:
# Call the .describe() method on our dataset. What do you observe?

uci.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [8]:
# Use the code below. How does the output differ from info() ?
uci.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

#### `.mean()`, .`min()`,` .max()`, `.sum()`

The methods `.mean()`, `.min()`, and `.max()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [9]:
uci.ca.mean()

0.7293729372937293

In [10]:
uci['ca'].mean()

0.7293729372937293

#### The Axis Variable

In [12]:
uci.sum() # Try [shift] + [tab] here!

age         16473.0
sex           207.0
cp            293.0
trestbps    39882.0
chol        74618.0
fbs            45.0
restecg       160.0
thalach     45343.0
exang          99.0
oldpeak       315.0
slope         424.0
ca            221.0
thal          701.0
target        165.0
dtype: float64

#### .`value_counts()`

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [18]:
uci['age'].value_counts()[:10]

58    19
57    17
54    16
59    14
52    13
51    12
62    11
44    11
60    11
56    11
Name: age, dtype: int64

Exercise: What are the different values for restecg?

In [19]:
# Your code here!
uci['restecg'].value_counts()

1    152
0    147
2      4
Name: restecg, dtype: int64

### Apply to Animal Shelter Data
Using `.info()` and `.describe()` and `dtypes` what observations can we make about the data?

What are the breed value counts?

How about age counts for dogs?

In [20]:
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [21]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104143 entries, 0 to 104142
Data columns (total 12 columns):
Animal ID           104143 non-null object
Name                71501 non-null object
DateTime            104143 non-null object
MonthYear           104143 non-null object
Date of Birth       104143 non-null object
Outcome Type        104137 non-null object
Outcome Subtype     47448 non-null object
Animal Type         104143 non-null object
Sex upon Outcome    104141 non-null object
Age upon Outcome    104120 non-null object
Breed               104143 non-null object
Color               104143 non-null object
dtypes: object(12)
memory usage: 9.5+ MB

In [22]:
animal_outcomes.shape

(104143, 12)

In [23]:
animal_outcomes.describe()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
count,104143,71501,104143,104143,104143,104137,47448,104143,104141,104120,104143,104143
unique,93390,17307,85774,85774,6537,9,21,5,5,49,2433,574
top,A721033,Max,04/18/2016 12:00:00 AM,04/18/2016 12:00:00 AM,09/01/2015,Adoption,Partner,Dog,Neutered Male,1 year,Domestic Shorthair Mix,Black/White
freq,30,468,39,39,118,45173,25973,59363,36635,19099,29885,10874

What are the breed `value_counts`?
What's the top breed for adopted dogs?

How about outcome counts for dogs?

In [25]:
animal_outcomes['Breed'].value_counts().to_frame()

                                           Breed
Domestic Shorthair Mix                     29885
Pit Bull Mix                                7928
Labrador Retriever Mix                      6173
Chihuahua Shorthair Mix                     5982
Domestic Medium Hair Mix                    3009
German Shepherd Mix                         2682
Bat Mix                                     1741
Domestic Shorthair                          1597
Domestic Longhair Mix                       1485
Australian Cattle Dog Mix                   1345
Siamese Mix                                 1201
Bat                                          986
Dachshund Mix                                972
Boxer Mix                                    876
Border Collie Mix                            853
Miniature Poodle Mix                         799
Siberian Husky Mix                           611
Catahoula Mix                                609
Staffordshire Mix                            604
Australian Shepherd Mix                      603
Rat Terrier Mix                              589
Yorkshire Terrier Mix                        586
Raccoon Mix                                  535
Beagle Mix                                   523
Jack Russell Terrier Mix                     519
Great Pyrenees Mix                           519
Miniature Schnauzer Mix                      518
Chihuahua Longhair Mix                       470
Cairn Terrier Mix                            461
Pointer Mix                                  454
...                                          ...
Basset Hound/Beauceron                         1
Pug/Boston Terrier                             1
Coton De Tulear                                1
English Bulldog/Pit Bull                       1
Rat Terrier/American Pit Bull Terrier          1
Dachshund/German Shepherd                      1
Chinese Sharpei/Boxer                          1
Mastiff/Plott Hound                            1
Chow Chow/Anatol Shepherd                      1
Dachshund/German Pinscher                      1
Vizsla/Catahoula                               1
Cocker Spaniel/Standard Poodle                 1
Mastiff/Cane Corso                             1
Cocker Spaniel/Miniature Schnauzer             1
Labrador Retriever/Spanish Water Dog           1
Chow Chow/Border Collie                        1
Norfolk Terrier/Cairn Terrier                  1
St. Bernard Rough Coat/Great Pyrenees          1
Whippet/Borzoi                                 1
Miniature Schnauzer/Wire Hair Fox Terrier      1
Polish Mix                                     1
Queensland Heeler/Great Dane                   1
Treeing Walker Coonhound/Plott Hound           1
Otter Mix                                      1
Border Terrier/Pug                             1
Sheep Mix                                      1
Whippet/Treeing Cur                            1
Entlebucher Mix                                1
Plott Hound/Whippet                            1
English Springer Spaniel/Beagle                1

[2433 rows x 1 columns]

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

In [26]:
def successor(x):
    return x + 1

In [27]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [28]:
uci.applymap(successor).head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,64,2,4,146,234,2,1,151,1,3.3,1,1,2,2
1,38,2,3,131,251,1,2,188,1,4.5,1,1,3,2
2,42,1,2,131,205,1,1,173,1,2.4,3,1,3,2
3,57,2,2,121,237,1,2,179,1,1.8,3,1,3,2
4,58,1,1,121,355,1,2,164,2,1.6,3,1,3,2

The `.map()` method takes a function as input that it will then apply to every entry in the Series.

In [33]:
uci['age'].map(successor)[50:60]

50    52
51    67
52    63
53    45
54    64
55    53
56    49
57    46
58    35
59    58
Name: age, dtype: int64

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [37]:
uci['oldpeak'].map(lambda x: round(x))[:4]

0    2
1    4
2    1
3    1
Name: oldpeak, dtype: int64

Exercise: Use an anonymous function to turn the entries in age to strings

In [39]:
uci['age'].map(lambda x: str(x)).dtypes

dtype('O')

### Apply to Animal Shelter Data

Use an `apply` to change the dates from strings to datetime objects. Similarly, use an apply to change the ages of the animals from strings to floats.

In [40]:
# Your code here
animal_outcomes.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A794272,Snoopy,07/18/2019 09:28:00 AM,07/18/2019 09:28:00 AM,05/06/2009,Adoption,Foster,Dog,Neutered Male,10 years,Chihuahua Shorthair Mix,Tan
1,A795398,*Jasper,07/18/2019 09:06:00 AM,07/18/2019 09:06:00 AM,04/16/2019,Adoption,Foster,Cat,Neutered Male,3 months,Domestic Longhair,Brown Tabby
2,A789119,Max,07/17/2019 10:00:00 PM,07/17/2019 10:00:00 PM,12/17/2014,Adoption,NaN,Dog,Neutered Male,4 years,Catahoula Mix,Red
3,A799891,NaN,07/17/2019 09:59:00 PM,07/17/2019 09:59:00 PM,05/06/2019,Adoption,NaN,Dog,Spayed Female,2 months,Labrador Retriever Mix,Red/White
4,A797488,*Runty,07/17/2019 07:20:00 PM,07/17/2019 07:20:00 PM,05/19/2019,Adoption,NaN,Cat,Intact Male,1 month,Domestic Shorthair,Blue Tabby

In [41]:
animal_outcomes['DateTime'] = pd.to_datetime(animal_outcomes['DateTime'])

In [43]:
animal_outcomes.dtypes

Animal ID                   object
Name                        object
DateTime            datetime64[ns]
MonthYear                   object
Date of Birth               object
Outcome Type                object
Outcome Subtype             object
Animal Type                 object
Sex upon Outcome            object
Age upon Outcome            object
Breed                       object
Color                       object
dtype: object

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [44]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

In [45]:
uci.groupby('sex').groups

{0: Int64Index([  2,   4,   6,  11,  14,  15,  16,  17,  19,  25,  28,  30,  35,
              36,  38,  39,  40,  43,  48,  49,  50,  53,  54,  59,  60,  65,
              67,  69,  74,  75,  82,  84,  85,  88,  89,  93,  94,  96, 102,
             105, 107, 108, 109, 110, 112, 115, 118, 119, 120, 122, 123, 124,
             125, 127, 128, 129, 130, 131, 134, 135, 136, 140, 142, 143, 144,
             146, 147, 151, 153, 154, 155, 161, 167, 181, 182, 190, 204, 207,
             213, 215, 216, 220, 223, 241, 246, 252, 258, 260, 263, 266, 278,
             289, 292, 296, 298, 302],
            dtype='int64'),
 1: Int64Index([  0,   1,   3,   5,   7,   8,   9,  10,  12,  13,
             ...
             288, 290, 291, 293, 294, 295, 297, 299, 300, 301],
            dtype='int64', length=207)}

In [48]:
uci.groupby('sex').get_group(0).head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
11,48,0,2,130,275,0,1,139,0,0.2,2,0,2,1
14,58,0,3,150,283,1,0,162,0,1.0,2,0,2,1

### Aggregating

In [55]:
uci.groupby('sex').age.std()

sex
0    9.409396
1    8.883803
Name: age, dtype: float64

Exercise: Tell me the average cholesterol level for those with heart disease.

In [61]:
# Your code here!
uci.groupby('target').chol.mean()

target
0    251.086957
1    242.230303
Name: chol, dtype: float64

### Apply to Animal Shelter Data

#### Task 1
- Use a groupby to show the average age of the different kinds of animal types.
- What about by animal types **and** gender?

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104143 entries, 0 to 104142
Data columns (total 12 columns):
Animal ID           104143 non-null object
Name                71501 non-null object
DateTime            104143 non-null datetime64[ns]
MonthYear           104143 non-null object
Date of Birth       104143 non-null object
Outcome Type        104137 non-null object
Outcome Subtype     47448 non-null object
Animal Type         104143 non-null object
Sex upon Outcome    104141 non-null object
Age upon Outcome    104120 non-null object
Breed               104143 non-null object
Color               104143 non-null object
dtypes: datetime64[ns](1), object(11)
memory usage: 9.5+ MB

#### Task 2:
- Create new columns `year` and `month` by using a lambda function x.year on date
- Use `groupby` and `.size()` to tell me how many animals are adopted by month

In [ ]:
# Your code here

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [77]:
uci.pivot(values = ['sex','age'], columns = 'target').head()

       sex      age
target   0    1   0     1
0      NaN  1.0 NaN  63.0
1      NaN  1.0 NaN  37.0
2      NaN  0.0 NaN  41.0
3      NaN  1.0 NaN  56.0
4      NaN  0.0 NaN  57.0

In [69]:
uci.shape

(303, 14)

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

### `.join()`

In [87]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns = ['age', 'HP'],index=['wizard','fighter'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns = ['age', 'HP'],)


toy1
#toy2.shape

         age   HP
wizard    63  142
fighter   33   47

In [85]:
toy2

   age   HP
0   63  100
1   33  200

In [90]:
toy1.join(toy2.set_index('age'),
          on = 'age',
          lsuffix = '_A',
          rsuffix = '_B').head()

         age  HP_A  HP_B
wizard    63   142   100
fighter   33    47   200

### `.merge()`

In [91]:
ds_chars = pd.read_csv('ds_chars.csv', index_col = 0)

In [92]:
states = pd.read_csv('states.csv', index_col = 0)

In [93]:
ds_chars.head()

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [103]:
states.head()

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

In [105]:
states.merge(ds_chars,
               left_on='state',
               right_on = 'home_state',
               how = 'inner')

  state   nickname     capital    name   HP home_state
0    WA  evergreen     Olympia    greg  200         WA
1    WA  evergreen     Olympia   miles  200         WA
2    TX      alamo      Austin    alan  170         TX
3    TX      alamo      Austin  rachel  200         TX
4    DC   district  Washington  alison  300         DC

### `pd.concat()`

Exercise: Look up the documentation on pd.concat (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and use it to concatenate ds_chars and states.
<br/>
Your result should still have only five rows!

In [ ]:
ds_chars

In [100]:
pd.concat([ds_chars, states],sort=False)

     name     HP home_state state   nickname     capital
0    greg  200.0         WA   NaN        NaN         NaN
1   miles  200.0         WA   NaN        NaN         NaN
2    alan  170.0         TX   NaN        NaN         NaN
3  alison  300.0         DC   NaN        NaN         NaN
4  rachel  200.0         TX   NaN        NaN         NaN
0     NaN    NaN        NaN    WA  evergreen     Olympia
1     NaN    NaN        NaN    TX      alamo      Austin
2     NaN    NaN        NaN    DC   district  Washington
3     NaN    NaN        NaN    OH    buckeye    Columbus
4     NaN    NaN        NaN    OR     beaver       Salem

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [106]:
ds_chars.head()

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [107]:
pd.melt(ds_chars,
        id_vars=['name'],
        value_vars=['HP', 'home_state'])

     name    variable value
0    greg          HP   200
1   miles          HP   200
2    alan          HP   170
3  alison          HP   300
4  rachel          HP   200
5    greg  home_state    WA
6   miles  home_state    WA
7    alan  home_state    TX
8  alison  home_state    DC
9  rachel  home_state    TX

## Bringing it all together with the Animal Shelter Data

Join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

The Url for the Intake Dataset is here: https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD

_Hints_ :
- import and clean the intake dataset first
- use apply/applymap/lambda to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new days-in-shelter variable
- Notice that some values in "days_in_shelter" column are NaN or values < 0 (remove these rows using the "<" operator and ~is.na())
- Use group_by to get some interesting information about the dataset

Make sure to export and save your cleaned dataset. We will use it in a later lecture!

use the notation `df.to_csv()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [ ]:
#code here